; domain
(define (domain zenotravel)
	(:requirements :typing :negative-preconditions)
	(:types
		Time - Object
		City - Object
		Aircraft - Thing
		Person - Thing
		Thing - Object
		FLevel - Object
	)
	(:predicates
		(at ?arg0 - Thing ?arg1 - City)
		(in ?arg0 - Person ?arg1 - Aircraft)
		(next ?arg0 - FLevel ?arg1 - FLevel)
		(max ?arg0 - FLevel)
        (min ?arg0 - FLevel)
        (not-min ?arg0 - FLevel)
		(fuel-level ?arg0 - Aircraft ?arg1 - FLevel)
	)
	(:action board
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(at ?p ?c)
                (at ?a ?c)
			)
		:effect
			(and
				(not (at ?p ?c))
				(in ?p ?a)
			)
	)

	(:action debark
		:parameters (?p - Person ?a - Aircraft ?c - City)
		:precondition
			(and
				(in ?p ?a)
                (at ?a ?c)
			)
		:effect
			(and
				(not (in ?p ?a))
				(at ?p ?c)
			)
	)

	(:action refuel
		:parameters (?a - Aircraft ?l - FLevel ?l1 - FLevel)
		:precondition
			(and
				(fuel-level ?a ?l)
			)
		:effect
			(and
				(not (fuel-level ?a ?l))
				(fuel-level ?a ?l1)
			)
	)

	(:action fly
		:parameters (?a - Aircraft ?c1 - City ?c2 - City ?l1 - FLevel ?l2 - FLevel)
		:precondition
			(and
				(at ?a ?c1)
				(fuel-level ?a ?l1)
                (next ?l2 ?l1)
			)
		:effect
			(and
				(not (at ?a ?c1))
				(at ?a ?c2)
				(not (fuel-level ?a ?l1))
				(fuel-level ?a ?l2)
			)
	)
)

; problem
(define (problem p19)
(:domain zenotravel)
(:objects
 f0 f1 f2 - FLevel
 a1 a2 - Aircraft
 c1 c2 c3 - City
 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 - Person
)
(:init
(min f0) (max f2)
(next f0 f1)
(not-min f1)
(next f1 f2)
(not-min f2)
(fuel-level a1 f2) (at a1 c3)
(fuel-level a2 f2) (at a2 c3)
(at p1 c2)
(at p2 c3)
(at p3 c1)
(at p4 c3)
(at p5 c3)
(at p6 c2)
(at p7 c1)
(at p8 c2)
(at p9 c2)
(at p10 c1)
)
(:goal (and
(at a1 c3)
(at a2 c3)
(at p1 c1)
(at p2 c1)
(at p3 c3)
(at p4 c2)
(at p5 c1)
(at p6 c3)
(at p7 c3)
(at p8 c3)
(at p9 c1)
(at p10 c3)
))
)

; plan
1. (fly a1 c3 c2 f2 f1)
   deleted: (at a1 c3) (fuel-level a1 f2)
   added: (at a1 c2) (fuel-level a1 f1)
   goals met: 1 of 12
2. (board p1 a1 c2)
   deleted: (at p1 c2)
   added: (in p1 a1)
   goals met: 1 of 12
3. (fly a1 c2 c1 f1 f0)
   deleted: (at a1 c2) (fuel-level a1 f1)
   added: (at a1 c1) (fuel-level a1 f0)
   goals met: 1 of 12
4. (debark p1 a1 c1)
   deleted: (in p1 a1)
   added: (at p1 c1)
   goals met: 2 of 12
5. (board p2 a2 c3)
   deleted: (at p2 c3)
   added: (in p2 a2)
   goals met: 2 of 12
6. (fly a2 c3 c1 f2 f1)
   deleted: (at a2 c3) (fuel-level a2 f2)
   added: (at a2 c1) (fuel-level a2 f1)
   goals met: 1 of 12
7. (debark p2 a2 c1)
   deleted: (in p2 a2)
   added: (at p2 c1)
   goals met: 2 of 12
8. (board p3 a1 c1)
   deleted: (at p3 c1)
   added: (in p3 a1)
   goals met: 2 of 12
9. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 2 of 12
10. (fly a1 c1 c3 f2 f1)
   deleted: (at a1 c1) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 3 of 12
11. (debark p3 a1 c3)
   deleted: (in p3 a1)
   added: (at p3 c3)
   goals met: 4 of 12
12. (board p4 a1 c3)
   deleted: (at p4 c3)
   added: (in p4 a1)
   goals met: 4 of 12
13. (fly a1 c3 c2 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 3 of 12
14. (debark p4 a1 c2)
   deleted: (in p4 a1)
   added: (at p4 c2)
   goals met: 4 of 12
15. (fly a2 c1 c3 f1 f0)
   deleted: (at a2 c1) (fuel-level a2 f1)
   added: (at a2 c3) (fuel-level a2 f0)
   goals met: 5 of 12
16. (board p5 a2 c3)
   deleted: (at p5 c3)
   added: (in p5 a2)
   goals met: 5 of 12
17. (refuel a2 f0 f2)
   deleted: (fuel-level a2 f0)
   added: (fuel-level a2 f2)
   goals met: 5 of 12
18. (fly a2 c3 c1 f2 f1)
   deleted: (at a2 c3) (fuel-level a2 f2)
   added: (at a2 c1) (fuel-level a2 f1)
   goals met: 4 of 12
19. (debark p5 a2 c1)
   deleted: (in p5 a2)
   added: (at p5 c1)
   goals met: 5 of 12
20. (board p6 a1 c2)
   deleted: (at p6 c2)
   added: (in p6 a1)
   goals met: 5 of 12
21. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 5 of 12
22. (fly a1 c2 c3 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 6 of 12
23. (debark p6 a1 c3)
   deleted: (in p6 a1)
   added: (at p6 c3)
   goals met: 7 of 12
24. (board p7 a2 c1)
   deleted: (at p7 c1)
   added: (in p7 a2)
   goals met: 7 of 12
25. (fly a2 c1 c3 f1 f0)
   deleted: (at a2 c1) (fuel-level a2 f1)
   added: (at a2 c3) (fuel-level a2 f0)
   goals met: 8 of 12
26. (debark p7 a2 c3)
   deleted: (in p7 a2)
   added: (at p7 c3)
   goals met: 9 of 12
27. (fly a1 c3 c2 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 8 of 12
28. (board p8 a1 c2)
   deleted: (at p8 c2)
   added: (in p8 a1)
   goals met: 8 of 12
29. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 8 of 12
30. (fly a1 c2 c3 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c3) (fuel-level a1 f1)
   goals met: 9 of 12
31. (debark p8 a1 c3)
   deleted: (in p8 a1)
   added: (at p8 c3)
   goals met: 10 of 12
32. (fly a1 c3 c2 f1 f0)
   deleted: (at a1 c3) (fuel-level a1 f1)
   added: (at a1 c2) (fuel-level a1 f0)
   goals met: 9 of 12
33. (board p9 a1 c2)
   deleted: (at p9 c2)
   added: (in p9 a1)
   goals met: 9 of 12
34. (refuel a1 f0 f2)
   deleted: (fuel-level a1 f0)
   added: (fuel-level a1 f2)
   goals met: 9 of 12
35. (fly a1 c2 c1 f2 f1)
   deleted: (at a1 c2) (fuel-level a1 f2)
   added: (at a1 c1) (fuel-level a1 f1)
   goals met: 9 of 12
36. (debark p9 a1 c1)
   deleted: (in p9 a1)
   added: (at p9 c1)
   goals met: 10 of 12
37. (board p10 a1 c1)
   deleted: (at p10 c1)
   added: (in p10 a1)
   goals met: 10 of 12
38. (fly a1 c1 c3 f1 f0)
   deleted: (at a1 c1) (fuel-level a1 f1)
   added: (at a1 c3) (fuel-level a1 f0)
   goals met: 11 of 12
39. (debark p10 a1 c3)
   deleted: (in p10 a1)
   added: (at p10 c3)
   goals met: 12 of 12
